Revit 2025 API
BuiltInFailures.ImportFailures.ATFNonUniformScalingTransform Property
 The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static FailureDefinitionId ATFNonUniformScalingTransform { get; }
Public Shared ReadOnly Property ATFNonUniformScalingTransform As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ATFNonUniformScalingTransform {
	FailureDefinitionId^ get ();
}
static member ATFNonUniformScalingTransform : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace